# GetMassIds Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassGBXMLExportOptions..::..GetMassIds Method
MassGBXMLExportOptions Class See Also
---
Gets a list of masses to use as shading surfaces in the exported gbXML--these masses must not have mass floors or mass zones so as not to end up with duplicate surface information in the gbXML output.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<ElementId> GetMassIds()
```

Visual Basic
---
```text
Public Function GetMassIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetMassIds()
```

# ### Return Value
The ids of the masses.
# See Also
MassGBXMLExportOptions Class
Autodesk.Revit.DB.Analysis Namespace